---
title: ColorFillSchemeEntry
classe: Autodesk.Revit.DB.ColorFillSchemeEntry
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 19
---

# ColorFillSchemeEntry

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Caption { get; set; }` | `colorFillSchemeEntry.Caption` | String |
| `Color Color { get; set; }` | `colorFillSchemeEntry.Color` | Color |
| `ElementId FillPatternId { get; set; }` | `colorFillSchemeEntry.FillPatternId` | ElementId |
| `Boolean IsInUse { get; }` | `colorFillSchemeEntry.IsInUse` | Boolean |
| `Boolean IsValidObject { get; }` | `colorFillSchemeEntry.IsValidObject` | Boolean |
| `Boolean IsVisible { get; set; }` | `colorFillSchemeEntry.IsVisible` | Boolean |
| `StorageType StorageType { get; }` | `colorFillSchemeEntry.StorageType` | StorageType |
| `Boolean CanSetValue(ElementId)` | `colorFillSchemeEntry.CanSetValue(value)` | Boolean |
| `Boolean CanSetValue(Double)` | `colorFillSchemeEntry.CanSetValue(value)` | Boolean |
| `Boolean CanSetValue(Int32)` | `colorFillSchemeEntry.CanSetValue(value)` | Boolean |
| `Void Dispose()` | `colorFillSchemeEntry.Dispose()` | Void |
| `Double GetDoubleValue()` | `colorFillSchemeEntry.GetDoubleValue()` | Double |
| `ElementId GetElementIdValue()` | `colorFillSchemeEntry.GetElementIdValue()` | ElementId |
| `Int32 GetIntegerValue()` | `colorFillSchemeEntry.GetIntegerValue()` | Int32 |
| `String GetStringValue()` | `colorFillSchemeEntry.GetStringValue()` | String |
| `Void SetDoubleValue(Double)` | `colorFillSchemeEntry.SetDoubleValue(value)` | Void |
| `Void SetElementIdValue(ElementId)` | `colorFillSchemeEntry.SetElementIdValue(value)` | Void |
| `Void SetIntegerValue(Int32)` | `colorFillSchemeEntry.SetIntegerValue(value)` | Void |
| `Void SetStringValue(String)` | `colorFillSchemeEntry.SetStringValue(value)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```